HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxCpu_bf.h
/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.DBABERRINJ */
#define IFX_CPU_FLASHCON3_DBABERRINJ_OFF (3u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.MBABERRINJ */
#define IFX_CPU_FLASHCON3_MBABERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.MBABERRINJ */
#define IFX_CPU_FLASHCON3_MBABERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.MBABERRINJ */
#define IFX_CPU_FLASHCON3_MBABERRINJ_OFF (4u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.ZBABERRINJ */
#define IFX_CPU_FLASHCON3_ZBABERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.ZBABERRINJ */
#define IFX_CPU_FLASHCON3_ZBABERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.ZBABERRINJ */
#define IFX_CPU_FLASHCON3_ZBABERRINJ_OFF (5u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.SBERERRINJ */
#define IFX_CPU_FLASHCON3_SBERERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.SBERERRINJ */
#define IFX_CPU_FLASHCON3_SBERERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.SBERERRINJ */
#define IFX_CPU_FLASHCON3_SBERERRINJ_OFF (6u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.DBERERRINJ */
#define IFX_CPU_FLASHCON3_DBERERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.DBERERRINJ */
#define IFX_CPU_FLASHCON3_DBERERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.DBERERRINJ */
#define IFX_CPU_FLASHCON3_DBERERRINJ_OFF (7u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.NVMCERRINJ */
#define IFX_CPU_FLASHCON3_NVMCERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.NVMCERRINJ */
#define IFX_CPU_FLASHCON3_NVMCERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.NVMCERRINJ */
#define IFX_CPU_FLASHCON3_NVMCERRINJ_OFF (8u)

/** \brief Length for Ifx_CPU_FLASHCON3_Bits.FLCONERRINJ */
#define IFX_CPU_FLASHCON3_FLCONERRINJ_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON3_Bits.FLCONERRINJ */
#define IFX_CPU_FLASHCON3_FLCONERRINJ_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON3_Bits.FLCONERRINJ */
#define IFX_CPU_FLASHCON3_FLCONERRINJ_OFF (9u)

/** \brief Length for Ifx_CPU_FLASHCON4_Bits.DDIS */
#define IFX_CPU_FLASHCON4_DDIS_LEN (1u)

/** \brief Mask for Ifx_CPU_FLASHCON4_Bits.DDIS */
#define IFX_CPU_FLASHCON4_DDIS_MSK (0x1u)

/** \brief Offset for Ifx_CPU_FLASHCON4_Bits.DDIS */
#define IFX_CPU_FLASHCON4_DDIS_OFF (0u)

/** \brief Length for Ifx_CPU_KRST0_Bits.RST */
#define IFX_CPU_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_CPU_KRST0_Bits.RST */
#define IFX_CPU_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_CPU_KRST0_Bits.RST */
#define IFX_CPU_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_CPU_KRST0_Bits.RSTSTAT */
#define IFX_CPU_KRST0_RSTSTAT_LEN (2u)

/** \brief Mask for Ifx_CPU_KRST0_Bits.RSTSTAT */
#define IFX_CPU_KRST0_RSTSTAT_MSK (0x3u)

/** \brief Offset for Ifx_CPU_KRST0_Bits.RSTSTAT */
#define IFX_CPU_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_CPU_KRST1_Bits.RST */
#define IFX_CPU_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_CPU_KRST1_Bits.RST */
#define IFX_CPU_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_CPU_KRST1_Bits.RST */
#define IFX_CPU_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_CPU_KRSTCLR_Bits.CLR */
#define IFX_CPU_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_CPU_KRSTCLR_Bits.CLR */
#define IFX_CPU_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_CPU_KRSTCLR_Bits.CLR */
#define IFX_CPU_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_CPU_RGN_LA_Bits.ADDR */
#define IFX_CPU_RGN_LA_ADDR_LEN (27u)

/** \brief Mask for Ifx_CPU_RGN_LA_Bits.ADDR */
#define IFX_CPU_RGN_LA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_CPU_RGN_LA_Bits.ADDR */
#define IFX_CPU_RGN_LA_ADDR_OFF (5u)

/** \brief Length for Ifx_CPU_RGN_UA_Bits.ADDR */
#define IFX_CPU_RGN_UA_ADDR_LEN (27u)

/** \brief Mask for Ifx_CPU_RGN_UA_Bits.ADDR */
#define IFX_CPU_RGN_UA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_CPU_RGN_UA_Bits.ADDR */
#define IFX_CPU_RGN_UA_ADDR_OFF (5u)

/** \brief Length for Ifx_CPU_RGN_ACCENA_Bits.EN */
#define IFX_CPU_RGN_ACCENA_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_RGN_ACCENA_Bits.EN */
#define IFX_CPU_RGN_ACCENA_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_RGN_ACCENA_Bits.EN */
#define IFX_CPU_RGN_ACCENA_EN_OFF (0u)

/** \brief Length for Ifx_CPU_RGN_ACCENB_Bits.EN */
#define IFX_CPU_RGN_ACCENB_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_RGN_ACCENB_Bits.EN */
#define IFX_CPU_RGN_ACCENB_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_RGN_ACCENB_Bits.EN */
#define IFX_CPU_RGN_ACCENB_EN_OFF (0u)

/** \brief Length for Ifx_CPU_SPR_SPROT_RGNACCENA_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA_R_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_SPR_SPROT_RGNACCENA_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA_R_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_SPR_SPROT_RGNACCENA_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENA_R_EN_OFF (0u)

/** \brief Length for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_SPR_SPROT_RGNACCENB_R_Bits.EN */
#define IFX_CPU_SPR_SPROT_RGNACCENB_R_EN_OFF (0u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENA_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENA_W_EN_OFF (0u)

/** \brief Length for Ifx_CPU_SFR_SPROT_ACCENB_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENB_W_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_SFR_SPROT_ACCENB_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENB_W_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_SFR_SPROT_ACCENB_W_Bits.EN */
#define IFX_CPU_SFR_SPROT_ACCENB_W_EN_OFF (0u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENA_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENA_R_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENA_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENA_R_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENA_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENA_R_EN_OFF (0u)

/** \brief Length for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN_MSK (0xffffffffu)

/** \brief Offset for Ifx_CPU_LPB_SPROT_ACCENB_R_Bits.EN */
#define IFX_CPU_LPB_SPROT_ACCENB_R_EN_OFF (0u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNLA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNLA_ADDR_LEN (27u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNLA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNLA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNLA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNLA_ADDR_OFF (5u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNUA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNUA_ADDR_LEN (27u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNUA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNUA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_CPU_DLMU_SPROT_RGNUA_Bits.ADDR */
#define IFX_CPU_DLMU_SPROT_RGNUA_ADDR_OFF (5u)

/** \brief Length for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN_LEN (32u)

/** \brief Mask for Ifx_CPU_DLMU_SPROT_RGNACCENA_W_Bits.EN */
#define IFX_CPU_DLMU_SPROT_RGNACCENA_W_EN_MSK (0xffffffffu)

